Музыкальный альбом записан в формате стерео с частотой дискретизации 48 кГц и разрешением 34 бит без использования сжатия. В альбоме 13 треков общей длительностью 42 минуты 20 секунд. Каждый трек содержит заголовок размером 110 Кбайт. Сколько секунд потребуется для скачивания альбома по каналу со скоростью передачи данных 314572800 бит/с? В ответе укажите целую часть числа.

	i = 2 * 48000 * 34 * (42 * 60 + 20) + 13 * 110 * 1024 * 8
	v = 314_572_800
	print(i / v)


Данные объемом 60 Мбайт передаются из пункта А в пункт Б по каналу связи, обеспечивающему скорость передачи данных 220 бит в секунду, а затем из пункта Б в пункт В по каналу связи, обеспечивающему скорость передачи данных 223 бит в секунду. От начала передачи данных из пункта А до их полного получения в пункте В прошло 10 минут. Сколько времени в секундах составила задержка в пункте Б, т.е. время между окончанием приема данных из пункта А и началом передачи данных в пункт В?

	l = 60 * 1024 * 1024 * 8
	v1 = 2**20
	v2 = 2**23
	z = l / v1
	x = l / v2
	print(10 * 60 - z - x)


Прибор автоматической фиксации нарушений правил дорожного движения делает цветные фотографии размером 1024×960 пикселей, используя палитру из 8192 цветов. Снимки сохраняются в памяти камеры, группируются в пакеты по несколько штук, затем передаются в центр обработки информации со скоростью передачи данных 1 474 560 бит/с. Каково максимально возможное число снимков в одном пакете, если на передачу одного пакета отводится не более 280 секунд?
В ответе запишите целое число.

	i = 1024 * 960 * 13
	v = 1_474_560
	for n in range(1, 1000000):
	    if i * n / v <= 280: print(n)


Аудиорегистратор формирует записи в формате стерео с частотой дискретизации 44 кГц и разрешением 16 бит без сжатия. Длительность каждой записи составляет 1 минуту. Аудиофайлы сохраняются в памяти устройства, группируются в пакеты по 32 штуки, затем передаются в центр обработки информации со скоростью передачи данных 1 802 240 бит/с. Сколько секунд потребуется для передачи одного пакета?
В ответе укажите целую часть числа.

	i = 2 * 44 * 1000 * 16 * 60 * 32
	v = 1_802_240
	print(i / v)


Голосовое сообщение продолжительностью 2 минуты было записано в формате стерео и оцифровано с глубиной кодирования 16 бит и частотой дискретизации 56 кГц. Сжатие данных не использовалось. Файл с оцифрованным голосовым сообщением был передан по каналу связи, пропускная способность которого 32 000 бит/с. 
Сколько секунд удастся сэкономить, если уменьшить частоту дискретизации в два раза? В ответе запишите целое число, единицу измерения указывать не нужно.

	i = 2 * 60 * 2 * 16 * 56 * 1000
	v = 32000
	i2 = i / 2
	print((i / v) - (i2 / v))


Музыкальный фрагмент был оцифрован и записан в виде файла без использования сжатия данных. Размер полученного файла составил 30 Мбайт. Получившийся файл был передан в город А по каналу связи за 15 секунд. Затем тот же музыкальный фрагмент был оцифрован повторно с разрешением в 2 раза меньше и частотой дискретизации в 3 раза выше, чем в первый раз. Сжатие данных не производилось. Полученный файл был передан в город Б за 5 секунд.
Определите среднюю скорость передачи в пункт Б в Мбайт/сек?

	vA = 30
	tA = 15
	vB = vA / 2 * 3
	tB = 5
	print(vB / tB)