Два указателя: левый и правый
Левый L всегда будет отвечать за индекс начала подстроки.
Правый R всегда будет отвечать за индекс конца подстроки.
Т.е. в целом два указателя описывают подстроку от L до R включительно.
Иначе говоря, для строки s фрагмент будет взят как s[l : r + 1]
Длина подстроки = r - l + 1

- в начале оба указателя стоят на нулевых индексах.
- после этого правый указатель начинает сдвигаться вправо и накапливать длину строки (расширять её) до тех пор, пока это не нарушает заданные в задаче условия.
- а потом, когда после сдвига правой границы наша подстрока перестала подходить под заданные в задаче условия (начала их нарушать), левый указатель начинает сдвигаться до тех пор, пока подстрока снова не станет подходить под заданные условия.



Текстовый файл состоит из символов T, U, V, W, X, Y и Z.
Определите в прилагаемом файле максимальное количество идущих подряд символов (длину непрерывной подпоследовательности), среди которых символ У встречается не более 150 раз.
Для выполнения этого задания следует написать программу.

	s = open('24_9753.txt').readline().strip()
	l = 0 # левый указатель
	ky = 0 # количество y внутри рассматриваемого фрагмента
	m = 0 # максимальная длина
	for r in range(len(s)): # сдвигаю правую границу, пока рассматриваемая строка подходит под условия
	    if s[r] == 'Y': ky += 1 # если в подстроке появился еще один y, то увеличиваем счетчик y
	    while ky > 150: #  пока нарушено условие
	        if s[l] == 'Y': ky -= 1 # если левая граница находится на y, 
	                                # то она сдвинется, и этот y исчезнет из текущей подстроки.
	                                # Фиксируем это в счетчике.
	        l += 1
	    # после цикла while (если он вообще запускался) наша подстрока от l до r включительно
	    # точно нам подходит
	    m = max(m, r - l + 1)
	print(m)

Текстовый файл содержит только заглавные буквы латинского алфавита (ABC…Z). Определите максимальное количество идущих подряд символов, среди которых каждая из букв C и D встречается не более двух раз.

	s = open('24_13100.txt').readline().strip()
	l = kc = kd = m = 0
	for r in range(len(s)):
	    if s[r] == 'C': kc += 1
	    if s[r] == 'D': kd += 1
	    while kc > 2 or kd > 2: 
	        if s[l] == 'C': kc -= 1
	        if s[l] == 'D': kd -= 1
	        l += 1
	    m = max(m, r - l + 1)
	print(m)

Текстовый файл состоит из символов F, G, Q, R, S и W. Определите в прилагаемом файле максимальное количество идущих подряд символов, среди которых подстрока FSRQ встречается ровно 80 раз. Для выполнения этого задания следует написать программу.

	s = open('24_19254.txt').readline().strip()
	l = m = k = 0
	for r in range(3, len(s)):
	    if s[r - 3: r + 1] == 'FSRQ': k += 1
	    while k > 80:
	        if s[l:l+4] == 'FSRQ': k -= 1
	        l += 1
	    if k == 80: m = max(m, r - l + 1)
	print(m)

Текстовый файл состоит не более чем из 10**6 символов и содержит только заглавные буквы латинского алфавита. Определите минимальную длину подстроки, в которой символ Z встречается не менее 120 раз.

	s = open('24_16682.txt').readline().strip()
	l = k = 0
	m = len(s)
	for r in range(len(s)):
	    if s[r] == 'Z': k += 1
	    while k >= 120: 
	        if k == 120 and s[l] == 'Z': break # если после сдвига подстрока
	                                        # уже не будет подходить, то я
	                                        # останавливаю сдвиги (приостанавливаю)
	                                        # корректировку.
	        if s[l] == 'Z': k -= 1
	        l += 1
	        if k == 120: m = min(m, r - l + 1)
	print(m)

Текстовый файл состоит из символов T, U, V, W, X, Y и Z. Определите в прилагаемом файле минимальное количество идущих подряд символов (длину непрерывной подпоследовательности), среди которых символ X встречается не менее 500 раз, а символ Y не встречается совсем.

	s = open('24_11954.txt').readline().strip()
	m = len(s)
	kx = l = 0
	for r in range(len(s)):
	    if s[r] == 'X': kx += 1
	    if s[r] == 'Y': 
	        l = r + 1 # телепортируем левую границу на первую 
	                # возможную подходящую позицию, потому что 
	                # все позиции от l до r включительно не подходят
	                # из-за наличия Y в подстроке. 
	        kx = 0 # обнуляю счетчик для X, так как подстрока стала пустой 
	    while kx >= 500:
	        if kx == 500 and s[l] == 'X': break
	        if s[l] == 'X': kx -= 1
	        l += 1 
	    if kx >= 500: m = min(m, r - l + 1)
	print(m)

Текстовый файл состоит из символов, обозначающих буквы латинского алфавита T, U, V, W, X, Y и Z.
Определите в прилагаемом файле минимальное количество идущих подряд символов (длину непрерывной подпоследовательности), среди которых комбинация символов TYZUX встречается ровно 78 раз, при этом искомая подпоследовательность не начинается на T и не заканчивается на X.
Для выполнения этого задания следует написать программу.

	s = open('24_23060.txt').readline().strip()
	m = len(s)
	k = l = 0
	for r in range(len(s)):
	    if s[r-4: r+1] == 'TYZUX': k += 1
	    if s[r] != 'X':
	        while k >= 78:
	            if k == 78 and s[l] != 'T': m = min(m, r - l + 1)
	            if k == 78 and s[l:l+5] == 'TYZUX': break
	            if s[l:l+5] == 'TYZUX': k -= 1
	            l += 1
	print(m)

Текстовый файл состоит из десятичных цифр и заглавных букв латинского алфавита. Определите в прилагаемом файле минимальное количество идущих подряд символов (длину непрерывной подпоследовательности), среди которых комбинация цифр 2025 (в указанном порядке) встречается 60 раз, при этом искомая последовательность начинается на комбинацию цифр 2025 (в указанном порядке) и содержит не менее 120 букв Y. Для выполнения этого задания следует написать программу.

	s = next(open('24_23228.txt')).strip()
	m = len(s)
	kc = ky = l = 0
	for r in range(len(s)):
	    if r - l + 1 >= 4 and s[r - 3: r + 1] == '2025': kc += 1
	    if s[r] == 'Y': ky += 1
	    while kc >= 60:
	        if kc == 60 and s[l:l+4] == '2025':
	            if ky >= 120: m = min(m, r - l + 1)
	            else: break
	        if s[l:l+4] == '2025': kc -= 1
	        l += 1
	print(m)