Букмекерская контора завела для хранения результатов скачек лошадей базу данных. В базе данных решено хранить следующую информацию — номер лошади и ее кличку.
Номер лошади находится в диапазоне от 1 до 1000 и кодируется с помощью одинакового и минимально возможного количества бит. В качестве клички лошади используется строка из 10 символов, каждый из которых может быть одной из заглавных букв русского алфавита. Кличка лошади кодируются посимвольно, каждый символ кодируется с помощью одинакового и минимально возможного количества бит.
Известно, что для всей записи (все 2 поля), используется минимально возможное целое количество байт.
Сколько байт необходимо выделить для хранения результата скачек, если в них участвовало 52 лошади?

	from math import *
	a = ceil(log2(1000))
	b = ceil(log2(33)) * 10
	print(ceil((a + b) / 8) * 52)

На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из 172 символов. В базе данных каждый серийный номер занимает одинаковое и минимально возможное число байт. При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит. Известно, что для хранения 356 984 серийных номеров потребовалось не менее 54 Мбайт памяти.
Определите минимально возможную мощность алфавита, используемого для записи серийных номеров. В ответе запишите только целое число.

	from math import *
	a = 172
	for i in range(1, 1000):
	    if ceil(a * i / 8) * 356984 >= 54*1024*1024:
	        print(2**(i-1) + 1)
	        break

При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 42 символов и содержащий только символы Н, Е, Й, Р, О, С, Т, Ь, 0, 2, 4. В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное целое число байт. При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым и минимально возможным количеством бит. Кроме собственно пароля, для каждого пользователя в системе хранятся дополнительные сведения, под них выделено определённое целое число байт; это число одно и то же для всех пользователей.
Для хранения сведений о 320 пользователях потребовалось 10 Кбайт. Сколько байт выделено для хранения дополнительных сведений об одном пользователе? В ответе запишите только целое число — количество байт.

	from math import *
	a = ceil(42 * ceil(log2(11)) / 8)
	for i in range(1, 1000):
	    if 320 * (a + i) == 10*1024: print(i)

В базе данных регистрационных данных о каждом пользователе хранятся следующие данные: дата рождения, номер паспорта и адрес проживания.
Дата рождения состоит из дня (1-31), месяца (1-12) и года (1900-2500), при этом для хранения даты отводится битовая последовательность одинаковой минимальной длины для всех пользователей, которая представляет собой одно двоичное число. Номер паспорта представлен как строка из 12 цифр от 0 до 9, каждая из которых кодируется одинаковым и минимально возможным количеством бит. Известно, что для кодирования информации об одном пользователе выделяется целое, одинаковое для всех пользователей минимальное количество байт. Известно, что адрес проживания содержит символы из алфавита мощностью 32, при этом используется посимвольное кодирование, и каждый символ кодируется одинаковым и минимально возможным количеством бит.
Известно, что для хранения данных о 1316 пользователях понадобилось 27 Кбайт памяти. Найдите максимальную длину строки, которая может быть адресом пользователя.

	from math import *
	a = ceil(log2(31 * 12 * (2500 - 1900 + 1)))
	b = ceil(log2(10)) * 12
	c = ceil(log2(32)) 
	r = []
	for i in range(1, 1000):
	    if ceil((a + b + c*i)/8) * 1316 <= 27*1024: r.append(i)
	print(max(r))

На предприятии каждой изготовленной детали присваивают серийный номер, содержащий десятичные цифры, 52 латинские буквы (с учётом регистра) и символы из 500-символьного специального алфавита. В базе данных каждый серийный номер занимает одинаковое и минимально возможное число байт. При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит. Известно, что для хранения 45 877 серийных номеров требуется более 49 Мбайт памяти.
Определите минимально допустимую длину серийного номера. В ответе запишите только целое число.

	from math import *
	a = ceil(log2(52 + 500 + 10))
	r = []
	for i in range(1, 1000):
	    if ceil(a * i / 8) * 45877 > 49*1024*1024: r.append(i)
	print(min(r))