Текстовый файл состоит из символов, обозначающих прописные буквы латинского алфавита.
Определите максимальное количество идущих подряд символов, среди которых никакие две буквы из набора букв N, О и Р (с учетом повторений) не записаны подряд.

	f = open('24_8510.txt')
	s = f.readline().strip().replace('O', 'N').replace('P', 'N')
	m = 0 # максимальная длина подходящей подстроки
	for i in range(len(s)): # перебираем все возможные точки старта
	    for j in range(i + m, len(s)): # перебираем все допустимые точки окончания / i + m - оптимизация
	        l = s[i : j + 1]
	        if 'NN' not in l: m = max(m, len(l)) # проверка условия и обновление m
	        elif 'NN' in l: break # проверка условия для break / оптимизация
	    if i % 100_000 == 0: print(i) # шкала прогресса
	print(m)

Текстовый файл содержит строку из заглавных латинских букв, всего не более чем из 106 символов. Определите количество подстрок длиной не менее 17 символов, которые начинаются и заканчиваются буквой A и не содержат других букв A (кроме первой и последней) и букв B.

	f = open('24_3018.txt')
	s = f.readline().strip()
	c = 0
	for i in range(len(s)):
	    for j in range(i, len(s)):
	        l = s[i:j + 1]
	        if l[0] == 'A':
	            if 'B' not in l:
	                if l.count('A') == 2:
	                    if l[-1] == 'A':
	                        if len(l) >= 17: c += 1 # увеличение счётчика после проверки условий
	                elif l.count('A') > 2: break
	            else: break
	        else: break
	    if i % 100_000 == 0: print(i)
	print(c)

Текстовый файл состоит из заглавных букв латинского алфавита A, B, C, D, E и F.
Определите в прилагаемом файле максимальное количество идущих подряд символов, среди которых пара AB (в указанном порядке) встречается ровно 100 раз.
Для выполнения этого задания следует написать программу.

	f = open('24_20909.txt')
	s = f.readline().strip()
	m = 0
	for i in range(len(s)):
	    for j in range(i + m, len(s)):
	        l = s[i:j + 1]
	        if l.count('AB') == 100: m = max(m, len(l))
	        elif l.count('AB') > 100: break
	    if i % 100_000 == 0: print(i)
	print(m)  

СЛОЖНАЯ!!
Текстовый файл состоит из десятичных цифр и заглавных букв латинского алфавита. Onределите в этом файле последовательность идущих подряд символов, представляющих собой запись максимального нечётного 12-ричного числа. В ответе запишите индекс (номер) первого символа (первой значащей цифры), с которого начинается запись этого числа в прилагаемом файле. Нумерация символов в текстовом файле начинается с нуля.
Примечание. Латинские буквы А и В - цифры из алфавита 12-ричной системы счисления.

	f = open('24_22356.txt')
	s = f.readline().strip()
	for x in 'CDEFGHIJKLMNOPQRSTUVWXYZ':
	    s = s.replace(x, '*')
	r = []
	m = 1
	for i in range(len(s)):
	    for j in range(i + (m - 1), len(s)): 
	        l = s[i : j + 1]
	        if l[0] != '0' and '*' not in l and l[-1] in '13579B': 
	            m = max(m, len(l))
	            if len(l) == 109: 
	                r.append(l)
	                print(l)
	        elif l[0] == '0' or '*' in l: break
	print(m)
	print(s.index(max(r)))