Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:
- символ "?" означает ровно одну произвольную цифру.
- символ "*" означает любую последовательность цифр произвольной длины. Кроме того, "*" может задавать и пустую последовательность.
Например, маске 123*475 соответствуют числа 123405 и 12300405.
Среди натуральных чисел, не превышающих 109, найдите все числа, соответствующие маске 273475678, делящиеся на число 151 без остатка.
В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце-
соответствующие им результаты деления этих чисел на 151.

	from fnmatch import *
	for i in range(151, 10**9 + 1, 151):
	    if fnmatch(str(i), '2?34?56?8'):
	        print(i, i // 151) 

Назовём маской числа последовательность цифр, в которой также могут встречаться следующие
символы:
символ «?» означает ровно одну произвольную цифру;
символ «#» означает последовательность из ровно трёх произвольных цифр.
Например, маске 123#475 соответствуют числа 123333405 и 123001405. Среди натуральных чисел, не превышающих 1010, найдите все числа, соответствующие маске 21#68779, делящиеся де на 1777 без остатка. В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце соответствующие им результаты деления этих чисел на 1777.

	from fnmatch import *
	for i in range(1777, 10**10 + 1, 1777):
	    if fnmatch(str(i), '21???68?79'):
	        print(i, i // 1777)

Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:
символ «?» означает ровно одну произвольную цифру;
символ «#» означает любую последовательность нечётных цифр произвольной длины; в том числе «#» может задавать и пустую последовательность.
Например, маске 123#475 соответствуют числа 123405 и 12300405.
Среди натуральных чисел, не превышающих 1010, найдите все числа, соответствующие маске 346#2772 и делящиеся на 2004 без остатка.
В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце соответствующие им
результаты деления этих чисел на 2004.

	for i in range(2004, 10**10 + 1, 2004):
	    if str(i)[0:3] == '346' and str(i)[-3:] == '772' and \
	    all(int(x) % 2 != 0 for x in str(i)[3:-4]) and len(str(i)) >= 8:
	        print(i, i // 2004)

Назовём маской числа последовательность цифр, в которой также могут встречаться следующие
символы:
-символ «?» означает ровно одну произвольную цифру;
- символ «*» означает любую последовательность цифр произвольной длины; в том числе «*» может задавать и пустую последовательность.
Например, маске 123*475 соответствуют числа 123405 и 12300405.
Среди натуральных чисел, не превышающих 1010, найдите все числа с нечётной суммой цифр, соответствующие
маске 112257*4 и делящиеся на 2024 без остатка.
В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце
- соответствующие им результаты деления этих чисел на 2024.

	from fnmatch import *
	for i in range(2024, 10**10 + 1, 2024):
	    if fnmatch(str(i), '112?57*4'):
	        if sum(list(map(int, str(i)))) % 2 != 0: print(i, i // 2024)

Назовём маской числа последовательность цифр, в которой также могут встречаться следующие
символы:
символ «?» означает ровно одну произвольную цифру;
символ «*» означает любую последовательность цифр произвольной длины; в том числе «*» может задавать и пустую последовательность.
Например, маске 123*475 соответствуют числа 123405 и 12300405.
Найдите первые пять чисел, больших 500 000, сумма делителей которых соответствует маске *77. Найденные числа выведите в порядке возрастания, справа от каждого запишите найденную сумму делителей.

	from fnmatch import *
	def f(n):
	    d = set()
	    for i in range(1, int(n**0.5) + 1):
	        if n % i == 0: d.add(i);d.add(n//i)
	    return d
	cnt = 0
	for i in range(500001, 10**10):
	    d = f(i)
	    if fnmatch(str(sum(d)), '*7?'): 
	        cnt += 1
	        print(i, sum(d))
	        if cnt == 5: break

Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:
символ «?» означает ровно одну произвольную цифру;
символ «*» означает любую последовательность цифр произвольной длины; в том числе «*» может задавать и пустую последовательность.
Например, маске 123*475 соответствуют числа 123405 и 12300405.
Найдите все числа, меньшие 106, которые имеют ровно 24 делителя, соответствующих маске 4*, и максимальный делитель таких чисел, соответствующий маске.
В ответе укажите найденные числа в порядке возрастания, справа от каждого числа выведите его максимальный делитель, соответствующий маске.

	from fnmatch import *
	def f(n):
	    d = set()
	    for i in range(1, int(n**0.5) + 1):
	        if n % i == 0: d.add(i);d.add(n//i)
	    return d
	for i in range(1, 10**6):
	    d = f(i)
	    m = list(x for x in d if fnmatch(str(x), '4*'))
	    if len(m) == 24 and fnmatch(str(max(m)), '4*'):
	        print(i, max(m))  